Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 07-Bow-Wow-and-Mew-Mew/CAT/corpus-genesis-ylt.en.utf8.tmx
Source language: en
Languages: chr

source: And it cometh to pass at that time that Abimelech speaketh -- Phichol also, head of his host -- unto Abraham, saying, 'God [is] with thee in all that thou art doing;
chr: ᎾᎯᏳᏃ ᎯᎠ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎠᏈᎻᎴᎩ ᎠᎴ ᏈᎪᎵ ᏄᎬᏫᏳᏒ ᎠᏍᎦᏰᎬᏍᏓ ᎠᏈᎻᎴᎩ ᏧᏤᎵᎦ ᎤᏂᏣᏘ ᎨᏒ ᏧᏓᏘᎾᎢ, ᎬᏩᏁᏤᎴ ᎡᏆᎭᎻ, ᎯᎠ ᎾᏂᏪᏍᎨᎢ, ᎤᏁᎳᏅᎯ ᏕᏣᎧᎿᏩᏗᏙᎭ ᏂᎦᎥ ᎪᎱᏍᏗ ᎭᏛᏁᎲᎢ.

source: and now, swear to me by God here: thou dost not lie to me, or to my continuator, or to my successor; according to the kindness which I have done with thee thou dost with me, and with the land in which thou hast sojourned.'
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎠᏂᏉ ᏍᏆᏎᎵᏓᏏ ᎤᏁᎳᏅᎯ ᏚᏙᏍᏛᎢ, ᎾᏍᎩ ᎦᎶᏄᎮᏛ ᏍᏋᏓᏁᏗᏱ ᏂᎨᏒᎾ, ᎠᏴ ᎠᏋᏒ, ᎠᎴ ᏗᏇᏥ, ᎠᎴ ᏗᏆᏁᏢᏔᏅᏛ; ᎾᏍᎩᏯᏍᎩᏂ ᎠᏴ ᎣᏍᏛ ᏂᎬᏯᏛᏁᎸᎢ, ᎾᏍᎩᏯ ᎾᏍᏉ ᎠᏴ ᏂᏍᏆᏛᏁᎮᏍᏗ, ᎠᎴ ᎦᏓ ᎠᎲ ᎾᎿ ᏤᏙᎸᎢ, ᎾᏍᎩᏯ ᎾᏍᏉ ᏅᏔᏛᏁᎵ.

source: And Abraham saith, 'I -- I do swear.'
chr: ᎡᏆᎭᎻᏃ ᎯᎠ ᏄᏪᏎᎢ, ᏓᎦᏎᎵᏔᏂᏉ.

source: And Abraham reasoned with Abimelech concerning the matter of a well of water which Abimelech's servants have taken violently away,
chr: ᎡᏆᎭᎻᏃ ᎤᎬᏍᎪᎸᏁ ᎠᏈᎻᎴᎩ ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎠᎹ ᎠᏢᏗᏱ ᎠᏓᎴᏒᎢ, ᎾᏍᎩ ᎠᏈᎻᎴᎩ ᏧᏅᏏᏓᏍᏗ ᎬᏍᎦᎢᏍᏓᎩ ᎬᏩᎩᎡᎸᎢ.

source: and Abimelech saith, 'I have not known who hath done this thing, and even thou didst not declare to me, and I also, I have not heard save to-day.'
chr: ᎠᏈᎻᎴᎩᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎥᏝ ᏱᏥᎦᏔᎭ ᎾᏍᎩ ᎯᎠ ᎢᏳᎾᏛᏁᎸᎯ ᎨᏒᎢ; ᎥᏝ ᎠᎴ ᏱᏍᎩᏃᏁᎴᎢ, ᎥᏝ ᎠᎴ ᏱᎦᏛᎩᏍᎨᎢ ᎩᎳ ᎪᎯ ᎢᎦ ᏥᎩ.

source: And Abraham taketh sheep and oxen, and giveth to Abimelech, and they make, both of them, a covenant;
chr: ᎡᏆᎭᎻᏃ ᎠᏫ ᎤᏂᏃᏕᎾ ᎠᎴ ᏩᎦ ᏫᏚᏯᏅᎮᎢ, ᎠᎴ ᎠᏈᎻᎴᎩ ᏚᏪᎧᏁᎴᎢ; ᎠᎴ ᎾᏍᎩ ᎠᏂᏔᎵ ᎧᏃᎮᏛ ᏚᎾᏠᎯᏍᏔᏁᎢ.

source: and Abraham setteth seven Lambs of the flock by themselves.
chr: ᎡᏆᎭᎻᏃ ᎦᎵᏉᎩ ᎠᏫ ᎤᏂᏃᏕᎾ ᎠᏂᎩᏏ ᎤᎾᏕᏘᏴᏛ ᎤᎾᏁᎳᎩ ᎢᏴᏛ ᏫᏚᏪᎧᏁᎢ.

source: And Abimelech saith unto Abraham, 'What [are] they -- these seven lambs which thou hast set by themselves?'
chr: ᎠᏈᎻᎴᎩᏃ ᎯᎠ ᏄᏪᏎᎴ ᎡᏆᎭᎻ, ᎦᏙᏃ ᎯᎠ ᎦᎵᏉᎩ ᎠᏫ ᎠᏂᎩᏏ ᎤᎾᏕᏘᏴᏛ ᎤᎾᏁᎳᎩ ᎢᏴᏛ ᏥᏕᎯᎧᎲᎦ?

source: And he saith, 'For -- the seven lambs thou dost accept from my hand, so that it becometh a witness for me that I have digged this well;'
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎯᎠᏍᎩᏂ ᎦᎵᏉᎩ ᎠᏫ ᎠᏂᎩᏏ ᎤᎾᏕᏘᏴᏛ ᏙᏓᏍᎩᏯᏅᎡᎵ, ᎾᏍᎩᏃ ᎬᏉᎯᏳᏓᏁᎯ ᎨᏎᏍᏗ ᎾᏍᎩ ᎠᏴ ᎠᏆᏍᎪᏒᎯ ᎨᏒ ᎯᎠ ᎠᎹ ᎠᏢᏗᏱ.

source: therefore hath he called that place 'Beer-Sheba,' for there have both of them sworn.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎾᎿ ᏈᏯᏏᏆ ᏚᏬᎡᎢ; ᏅᏗᎦᎵᏍᏙᏗᏍᎨ ᎾᎿ ᎢᏧᎳ ᎾᏍᎩ ᎠᏂᏔᎵ ᎤᎾᏎᎵᏔᏅᎢ.

source: And they make a covenant in Beer-Sheba, and Abimelech riseth -- Phichol also, head of his host -- and they turn back unto the land of the Philistines;
chr: ᎾᏍᎩᏃ ᏈᏯᏏᏆ ᏚᏙᎥ ᎧᏃᎮᏛ ᏚᎾᏠᎯᏍᏔᏁᎢ; ᎿᏉᏃ ᎠᏈᎻᎴᎩ ᏚᎴᏁᎢ, ᎠᎴ ᏈᎪᎵ ᏄᎬᏫᏳᏒ ᎠᏍᎦᏰᎬᏍᏓ ᎠᏈᎻᎴᎩ ᏧᏤᎵᎦ ᎤᏂᏣᏘ ᏧᏓᏘᎾᎢ, ᎠᎴ ᎢᎤᎾᏨᏎ ᎠᏂᏈᎵᏍᏗ ᎤᎾᏤᎵᎪᎯ ᏫᎤᏂᎷᏤᎢ.

source: and [Abraham] planteth a tamarisk in Beer-Sheba, and preacheth there in the name of Jehovah, God age-during;
chr: [ᎡᏆᎭᎻᏃ] ᎤᏪᎧᏁ ᎡᏏᎵ ᏡᎬᎢ ᏈᏯᏏᏆ ᏚᏙᎥᎢ, ᎠᎴ ᎾᎿ ᎤᏓᏙᎵᏍᏔᏁᎴ ᏱᎰᏩ ᎾᏍᎩ ᏫᎾᏍᏛᎾ ᎡᎯ ᎤᏁᎳᏅᎯ.

source: and Abraham sojourneth in the land of the Philistines many days.
chr: ᎡᏆᎭᎻᏃ ᎠᏂᏈᎵᏍᏗ ᎤᎾᏤᎵᎪᎯ ᎦᏙᎯ ᎪᎯᏗᏳ ᎤᏪᏙᎴᎢ.

source: Chapter 22
chr: ᎠᏯᏙᎸᎢ 22

source: And it cometh to pass after these things that God hath tried Abraham, and saith unto him, 'Abraham;' and he saith, 'Here [am] I.'
chr: ᎣᏂᏃ ᎯᎠ ᎾᏍᎩ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎤᎪᎵᏰᎡ ᎡᏆᎭᎻ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎡᏆᎭᎻ; ᎡᏆᎭᎻᏃ ᎠᏂ, ᎤᏛᏁᎢ.

source: And He saith, 'Take, I pray thee, thy son, thine only one, whom thou hast loved, even Isaac, and go for thyself unto the land of Moriah, and cause him to ascend there for a burnt-offering on one of the mountains of which I speak unto thee.'
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎯᏯᏘᏄᎦ ᏤᏥ, ᎾᏍᎩ ᎤᏩᏒᎯᏳ ᏤᏥ, ᎡᏏᎩ ᏧᏙᎢᏛ, ᎾᏍᎩ ᎯᎨᏳᎢ ᏥᎩ, ᎠᎴ ᎼᎵᏯ ᎦᏓ ᏗᎲ ᏫᎷᎩ; ᎠᎴ ᎾᎿ ᎯᏯᎵᏍᎪᎸᏔᏅᎭ ᎠᏥᎸ ᎨᎳᏍᏙᏗ, ᎾᎿ ᎣᏓᎸ ᏨᏓᎬᏯᏎᎮᎵ.

source: And Abraham riseth early in the morning, and saddleth his ass, and taketh two of his young men with him, and Isaac his son, and he cleaveth the wood of the burnt-offering, and riseth and goeth unto the place of which God hath spoken to him.
chr: ᎡᏆᎭᎻᏃ ᏑᎾᎴᏉ ᎤᏗᏛᎮᎢ, ᎠᎴ ᎤᏪᏰᎱᎳᏁ ᎤᏤᎵ ᏗᎦᎵᏯᏅᎯᏛ, ᎠᎴ ᎠᏂᏔᎵ ᎠᏂᏫᏅ ᏧᏅᏏᏓᏍᏗ ᏚᏘᏅᏎᎢ, ᎠᎴ ᎤᏪᏥ ᎡᏏᎩ, ᎠᎴ ᎠᏓ ᏚᏍᏡᏰ ᎠᏥᎸ ᎨᎳᏍᏗᏱ ᎪᏙᏗ, ᏚᎴᏁᏃ, ᎠᎴ ᎾᎿ ᎤᏁᎳᏅᎯ ᎤᏁᎢᏍᏓᏁᎸ ᏭᎶᏎᎢ.

source: On the third day -- Abraham lifteth up his eyes, and seeth the place from afar;
chr: ᏦᎢᏁᏃ ᎢᎦ ᎡᏆᎭᎻ ᏫᏚᎧᎿᏁᎢ, ᎠᎴ ᎢᏅ ᏚᎪᎮ ᎾᎿ ᏩᎦᏛᎢ.

source: and Abraham saith unto his young men, 'Remain by yourselves here with the ass, and I and the youth go yonder and worship, and turn back unto you.'
chr: ᎡᏆᎭᎻᏃ ᎯᎠ ᏂᏚᏪᏎᎴ ᎠᏂᏫᏅ ᏧᏅᏏᏓᏍᏗ, ᎠᏂᏉ ᎢᏍᏕᏙᎮᏍᏗ ᏗᎦᎵᏯᏅᎯᏛ ᎡᏍᏗᎦᏘᏰᏍᏗ; ᎠᏴᏃ ᎠᎴ ᎠᏫᏄᏣ Ꭸ ᏮᏓᏲᏍᏓᏓᏙᎵᏍᏔᏂ, ᏔᎵᏁᏃ ᎢᏍᏛᎷᏤᎸᎭ.

source: And Abraham taketh the wood of the burnt-offering, and placeth on Isaac his son, and he taketh in his hand the fire, and the knife; and they go on both of them together.
chr: ᎡᏆᎭᎻᏃ ᎠᏓ ᏚᏴᎮ ᎠᏥᎸ ᎨᎳᏍᏗᏱ ᎪᏙᏗ ᎠᎴ ᏚᏃᎭᏝᏗᏍᏔᏁ ᎤᏪᏥ ᎡᏏᎩ; ᎠᏥᎸᏃ ᎤᏴᏎᎢ, ᎠᎴ ᎭᏰᎳᏍᏗ ᎤᏪᏅᏎᎢ, ᎾᏍᎩᏃ ᎠᏂᏔᎵ ᎢᏧᎳᎭ ᎤᏁᏅᏎᎢ.

source: And Isaac speaketh unto Abraham his father, and saith, 'My father,' and he saith, 'Here [am] I, my son.' And he saith, 'Lo, the fire and the wood, and where the lamb for a burnt-offering?'
chr: ᎡᏏᎩᏃ ᎤᏁᏤᎴ ᎤᏙᏓ ᎡᏆᎭᎻ, ᎯᎠ ᏄᏪᏎᎢ, ᎡᏙᏓ; ᎡᏆᎭᎻᏃ ᎠᏂ, ᎠᏇᏥ, ᎤᏛᏁᎢ, ᎡᏏᎩᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎬᏂᏳᏉ, ᎠᏉ ᎠᏥᎸ ᎠᎴ ᎠᏓ, ᎠᏫᏍᎩᏂ ᎠᏥᎸ ᎨᎳᏍᏙᏗ ᎭᏢ?

source: and Abraham saith, 'God doth provide for Himself the lamb for a burnt-offering, my son;' and they go on both of them together.
chr: ᎡᏆᎭᎻᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎠᏇᏥ, ᎤᏁᎳᏅᎯ ᎤᏩᏒ ᏛᏓᏩᏛᎡᎵ ᎠᏫ ᎠᏥᎸ ᎨᎳᏍᏙᏗ; ᎾᏍᎩᏃ ᎠᏂᏔᎵ ᎢᏧᎳᎭ ᎬᎾᎢᏎᏉ.

source: And they come in unto the place of which God hath spoken to him, and there Abraham buildeth the altar, and arrangeth the wood, and bindeth Isaac his son, and placeth him upon the altar above the wood;
chr: ᎿᏉᏃ ᎤᏂᎷᏤ ᎾᎿ ᎤᏁᎳᏅᎯ ᎤᏁᎢᏍᏓᏁᎸᎢ; ᎡᏆᎭᎻᏃ ᎠᏥᎸ ᎨᎳᏍᏗᏱ ᎤᏬᏢᏁ ᎾᎿᏂ, ᎠᎴ ᎠᏓ ᎣᏍᏛ ᏚᏝᏕᎢ, ᎠᎴ ᎤᎸᎴ ᎤᏪᏥ ᎡᏏᎩ, ᎠᎴ ᎠᏥᎸ ᎨᎳᏍᏗᏱ ᎤᏢᏁᎢ, ᎠᏓ ᏕᎠᏢ ᎦᏚᎢ.

source: and Abraham putteth forth his hand, and taketh the knife -- to slaughter his son.
chr: ᎡᏆᎭᎻᏃ ᎤᏙᏯᏅᎯᏕ ᎠᎴ ᎭᏰᎳᏍᏗ ᎤᏴᎮ ᎤᎯᏍᏙᏗ ᎤᏪᏥ.

source: And the messenger of Jehovah calleth unto him from the heavens, and saith, 'Abraham, Abraham;' and he saith, 'Here [am] I;'
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᏱᎰᏩ ᎤᏤᎵᎦ ᏧᏁᏤᎴ ᎦᎸᎳᏗ, ᎯᎠ ᏅᏧᏪᏎᎢ, ᎡᏆᎭᎻ, ᎡᏆᎭᎻ: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎠᏂ.

source: and He saith, 'Put not forth thine hand unto the youth, nor do anything to him, for now I have known that thou art fearing God, and hast not withheld thy son, thine only one, from Me.'
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᏞᏍᏗ ᎯᏯᏏᏔᏛᎩ ᎠᏫᏄᏣ, ᏞᏍᏗ ᎠᎴ ᎪᎱᏍᏗ ᎯᏴᏁᎸᎩ; ᎿᏉᏰᏃ ᏥᎦᏔᎭ ᎤᏁᎳᏅᎯ ᎯᎾᏰᏍᎬᎢ, ᏂᏍᎩᎨᏳᏔᏅᎾ ᏥᎩ ᏤᏥ, ᎤᏩᏒᎯᏳ ᏤᏥ.

source: And Abraham lifteth up his eyes, and looketh, and lo, a ram behind, seized in a thicket by its horns; and Abraham goeth, and taketh the ram, and causeth it to ascend for a burnt-offering instead of his son;
chr: ᎡᏆᎭᎻᏃ ᏚᏌᎳᏓᏁ ᏗᎦᏙᎵ, ᎠᎴ ᏫᏚᎧᎿᏁᎢ, ᎠᎴ ᏭᎪᎮ ᎤᏐᎭᏛ ᎢᏗᏢ ᎠᏫ ᎤᏙᏕᎾ ᏧᎪᏅᏍᏓᎵ ᏧᏲᏅᎯ ᏕᎫᏓᎸᏕ ᎤᎾᏍᏓᎸᎢ; ᎡᏆᎭᎻᏃ ᎤᏪᏅᏎ ᏭᏯᏅᎮ ᎾᏍᎩ ᎠᏫ ᎤᏃᏕᎾ, ᎠᎴ ᎤᎵᏍᎪᎸᏔᏁ ᎠᏥᎸ ᎨᎳᏍᏙᏗ ᎤᏁᏟᏴᏍᏔᏁ ᎤᏪᏥ.

source: and Abraham calleth the name of that place 'Jehovah-Jireh,' because it is said this day in the mount, 'Jehovah doth provide.'
chr: ᎡᏆᎭᎻᏃ ᏱᎰᏩ-ᏱᎴ ᏚᏬᎡ ᎾᎿᏂ; ᎾᏍᎩ ᎩᎳᎯᏳ ᎢᎦᏪᏛ ᏥᎩ, ᏱᎰᏩ ᎤᏤᎵ ᎣᏓᎸ ᎠᏩᏛᏗ ᎨᏎᏍᏗ.

source: And the messenger of Jehovah calleth unto Abraham a second time from the heavens,
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᏱᎰᏩ ᎤᏤᎵᎦ ᏔᎵᏁ ᎦᎸᎳᏗ ᏗᎤᏁᏤᎴ ᎡᏆᎭᎻ,

source: and saith, 'By Myself I have sworn -- the affirmation of Jehovah -- that because thou hast done this thing, and hast not withheld thy son, thine only one --
chr: ᎠᎴ ᎯᎠ ᏅᏧᏪᏎᎢ, ᎠᏋᏒ ᎨᎥ ᎠᏆᏎᎵᏙᏔᏅ, ᎠᏗᎭ ᏱᎰᏩ, ᎯᎠ ᏥᏂᏣᏛᏁᎸ, ᎠᎴ ᏤᏥ, ᎾᏍᎩ ᎤᏩᏒᎯᏳ ᏤᏥ, ᏂᏍᎩᎨᏳᏔᏅᎾ ᏥᎩ ᏅᏗᎦᎵᏍᏙᏗᎭ;

source: that blessing I bless thee, and multiplying I multiply thy seed as stars of the heavens, and as sand which [is] on the sea-shore; and thy seed doth possess the gate of his enemies;
chr: ᎾᏍᎩ ᏂᎯ ᎤᏣᏘ ᎣᏍᏛ ᏅᏓᎬᏯᏛᏁᎵ, ᎠᎴ ᏣᏁᏢᏔᏅᎯ ᎨᏒ ᎤᏣᏘ ᏓᎦᏥᏁᏉᎢ, ᎾᏍᎩᏯ ᏥᏄᏂᏧᏈᏍᏗ ᏃᏈᏏ ᎦᎸᎳᏗ ᏣᏂᎧᎳ, ᎠᎴ ᎾᏍᎩᏯ ᏃᏳ ᏥᏄᏧᏈᏍᏗ ᎠᎺᏉᎯ ᎠᎹᏳᎶᏗ ᏥᎦᎳᎨᏯ, ᎾᏍᎩᏯ ᏅᏓᎦᏥᏴᏁᎵ; ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᏧᎾᏤᎵᎦ ᎨᏎᏍᏗ ᎬᏩᏂᏍᎦᎩ ᏚᏂᏍᏚᎲᎢ.

source: and blessed themselves in thy seed have all nations of the earth, because that thou hast hearkened to My voice.'
chr: ᎠᎴ ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎨᏒ ᏅᏓᎦᎵᏍᏙᏔᏂ ᏄᎾᏓᎴᏒ ᏴᏫ ᎡᎶᎯ ᎠᏁᎲ ᎣᏍᏛ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎨᏎᏍᏗ; ᏥᏁᎬ ᏦᎯᏳᎲᎦ ᏅᏗᎦᎵᏍᏙᏗᎭ.

source: And Abraham turneth back unto his young men, and they rise and go together unto Beer-Sheba; and Abraham dwelleth in Beer-Sheba.
chr: ᎡᏆᎭᎻᏃ ᎠᏂᏫᏅ ᏧᏅᏏᏓᏍᏗ ᏫᏙᎤᎷᏤᎴᎢ, ᏚᎾᎴᏁᏃ, ᎠᎴ ᎢᏧᎳᎭ ᏈᏯᏏᏆ ᏭᏂᎶᏎᎢ; ᎡᏆᎭᎻᏃ ᏈᏯᏏᏆ ᏪᎮᎢ.

source: And it cometh to pass after these things that it is declared to Abraham, saying, 'Lo, Milcah hath borne, even she, sons to Nahor thy brother:
chr: ᎣᏂᏃ ᎯᎠ ᎾᏍᎩ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎡᏆᎭᎻ ᎠᏥᏃᏁᎴ ᎯᎠ ᏫᏥᏪᏎᎴᎢ, ᎬᏂᏳᏉ, ᎻˌᎵᎦ ᏗᏂᏲᎵ ᏚᎾᏄᎪᏫᏎᎸ ᏗᏍᏓᏓᏅᏟ ᏁᎰ,

source: Huz his first-born, and Buz his brother; and Kemuel father of Aram,
chr: ᎭᏏ ᎤᏓᏂᎵᎨᎢ, ᏆᏏᏃ ᎤᏅᏟ, ᎠᎴ ᎨᎽᎡᎵ ᎡᎳᎻ ᎤᏙᏓ,

source: and Chesed, and Hazo, and Pildash, and Jidlaph, and Bethuel;
chr: ᎠᎴ ᎨᏎᏗ, ᎠᎴ ᎮᏐ, ᎠᎴ ᏈᎵᏓᏏ, ᎠᎴ ᏱᏗᎳᏈ, ᎠᎴ ᏇᏚᎡᎵ.

source: and Bethuel hath begotten Rebekah;' these eight hath Milcah borne to Nahor, Abraham's brother;
chr: ᏇᏚᎡᎵᏃ ᎤᏪᏥ ᎵᏇᎩ ᎤᏕᏁᎴᎢ; ᎾᏍᎩ ᎯᎠ ᏧᏁᎳ ᎢᏯᏂᏛ ᎻˌᎵᎦ ᏚᎾᏄᎪᏫᏎᎴ ᏁᎰ, ᎡᏆᎭᎻ ᏗᎾᏓᏅᏟ.

source: and his concubine, whose name [is] Reumah, she also hath borne Tebah, and Gaham, and Tahash, and Maachah.
chr: ᏔᎵᏃ ᏧᏩᏔᏁ ᏧᏓᏴᏎ ᎵᏳᎹ ᏧᏙᎢᏛ, ᎾᏍᎩ ᎾᏍᏉ ᏚᎾᏄᎪᏫᏎᎢ, ᏘᏆ, ᎠᎴ ᎨᎭᎻ, ᏓᎭᏏ, ᎠᎴ ᎺᎠᎧ.

source: Chapter 23
chr: ᎠᏯᏙᎸᎢ 23

source: And the life of Sarah is a hundred and twenty and seven years -- years of the life of Sarah;
chr: ᏎᎵᏃ ᎠᏍᎪᎯᏧᏈ ᎦᎵᏉᎩᏦᏁ ᎢᏳᏕᏘᏴᏛ ᏄᎵᏍᏔᏁᎢ; ᎾᏍᎩ ᎯᎠ ᏄᏕᏘᏴᎮ ᎤᎴᏂᏙᎴ ᏎᎵ.

source: and Sarah dieth in Kirjath-Arba, which [is] Hebron, in the land of Caanan, and Abraham goeth in to mourn for Sarah, and to bewail her.
chr: ᏎᎵᏃ ᎤᏲᎱᏎ ᎩᎵᎠ-ᎠᏆ ᏚᏙᎥᎢ; ᎾᏍᎩ ᎯᎠ ᎯᏆᏂ ᏥᏚᏙᎠ ᎨᎾᏂ ᎦᏓ ᎠᎲᎢ; ᎡᏆᎭᎻᏃ ᎤᎷᏤ ᎤᏲ ᎤᏓᏅᏓᏗᎴ ᏎᎵ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᎢ ᎠᎴ ᎤᏍᎪᏂᎵᎴᎢ.

source: And Abraham riseth up from the presence of his dead, and speaketh unto the sons of Heth, saying,
chr: ᎡᏆᎭᎻᏃ ᏚᎴᏁ ᎤᏲᎱᎯᏎᎸᎯ ᎦᏅᎢ, ᎠᎴ ᏚᏁᏤᎴ ᎮᏗ ᏧᏪᏥ, ᎯᎠ ᏄᏪᏎᎢ,

source: 'A sojourner and a settler I [am] with you; give to me a possession of a burying-place with you, and I bury my dead from before me.'
chr: ᎠᏴ ᏅᏆᏓᎴ ᎠᎴ ᎨᏙᎯᏉ ᎢᏤᎲᎢ; ᏍᎩᎥᏏ ᏗᏆᏓᏂᏐᏗᏱ ᎢᏤᎲᎢ, ᎾᏍᎩ ᏗᏥᏂᏐᏗᏱ ᏗᎬᎩᏲᎱᎯᏎᎸᎯ ᎾᎿ ᏗᏥᎪᏩᏛᏗᏱ ᏂᎨᏒᎾ.

source: And the sons of Heth answer Abraham, saying to him,
chr: ᎮᏗᏃ ᏧᏪᏥ ᎬᏩᏁᏤᎴ ᎡᏆᎭᎻ, ᎯᎠ ᏂᎬᏩᏪᏎᎴᎢ,

source: 'Hear us, my lord; a prince of God [art] thou in our midst; in the choice of our burying-places bury thy dead: none of us his burying-place doth withhold from thee, from burying thy dead.'
chr: ᏍᎩᏯᏛᏓᏍᏓᏏ, ᏣᎬᏫᏳᎯ ᎠᏆᏤᎵ, ᎤᏣᏘ ᎡᎶᎸᏉᏗᏳ ᏣᎬᏫᏳᎯ ᏥᏍᎩᏰᎳᏗᏙᎭ; ᏦᎯᏍᏙᏗ ᏦᎦᏓᏂᏐᏗᏱ ᏣᏕᎯᏂᏏᏍᎨᏍᏗ ᏗᎨ ᏲᎱᎯᏎᎸᎯ; ᎥᏝ ᎠᏏᏴᏫ ᎠᏴ ᏃᎦᏛᏅ ᏣᎨᏳᏙᏗ ᏱᎨᏎᏍᏗ ᏧᏓᏂᏐᏗᏱ; ᎾᏍᎩ ᎯᏂᏐᏗᏱ ᏂᎨᏒᎾ ᏣᏲᎱᎯᏎᎸᎯ.

source: And Abraham riseth and boweth himself to the people of the land, to the sons of Heth,
chr: ᎡᏆᎭᎻᏃ ᏚᎴᏁᎢ, ᎠᎴ ᏚᏗᏌᏓᏕᎴ ᏴᏫ ᎾᎿ ᎠᏁᎯ, ᎾᏍᎩ ᎯᎠ ᎮᏗ ᏧᏪᏥ,

source: and he speaketh with them, saying, 'If it is your desire to bury my dead from before me, hear me, and meet for me with Ephron, son of Zoar;
chr: ᎠᎴ ᏚᎵᏃᎮᏔᏁᎢ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᎢᏳᏃ ᎣᏏᏳ ᎢᏥᏰᎸᏍᎨᏍᏗ ᏥᏂᏐᏗᏱ ᎠᎩᏲᎱᎯᏎᎸᎯ ᏥᎪᏩᏛᏗᏱ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ, ᏍᎩᏯᏛᎬᎦ, ᎠᎴ ᏍᎩᏍᏕᎸ ᎡᏥᏔᏲᏏ ᎢᏆᎶᏂ ᏐᎭ ᎤᏪᏥ;

source: and he giveth to me the cave of Machpelah, which he hath, which [is] in the extremity of his field; for full money doth he give it to me, in your midst, for a possession of a burying-place.'
chr: ᎾᏍᎩ ᎠᎩᏁᏗᏱ ᎤᏍᏓᎦᎸ ᎹᏈᎳ, ᎾᏍᎩ ᎤᏤᎵᎦ ᏥᎩ, ᎾᏍᎩ ᎤᎶᎨᏒ ᏩᏍᏛ ᏧᏍᏓᎦᎸ; ᎾᏍᎩ ᎢᎦᎢᏉ ᎠᏕᎸ ᏧᎬᏩᎶᏗ ᎨᏒ ᏓᎩᎬᏩᎶᏓᏁᎸᎭ, ᎠᎩᏁᎸᎭ, ᎠᏆᏤᎵᎦ ᏂᎦᎵᏍᏔᏅᎭ ᎾᏍᎩ ᏗᏆᏓᏂᏐᏗᏱ ᎢᏤᎲᎢ.

source: And Ephron is sitting in the midst of the sons of Heth, and Ephron the Hittite answereth Abraham in the ears of the sons of Heth, of all those entering the gate of his city, saying,
chr: ᎢᏆᎶᏂᏃ ᎮᏗ ᏧᏪᏥ ᎠᏁᎲ ᎤᏓᏑᏰᎢ; ᎢᏆᎶᏂᏃ ᎠᎯᏗ ᎤᏁᏤᎴ ᎡᏆᎭᎻ ᎠᏂᎦᏔᎲ ᎮᏗ ᏧᏪᏥ, ᎾᏍᎩ ᏂᎦᏛ ᎤᏤᎵᎦ ᎦᏚᎲ ᎠᏐᏴ ᎦᎶᎯᏍᏗᏱ ᎠᏂᏴᏍᏗᏍᎩ, ᎯᎠ ᏄᏪᏎᎢ,

source: 'Nay, my lord, hear me: the field I have given to thee, and the cave that [is] in it, to thee I have given it; before the eyes of the sons of my people I have given it to thee -- bury thy dead.'
chr: ᎥᏝ, ᏣᎬᏫᏳᎯ ᎠᏆᏤᎵᎦ, ᎠᏴᏍᎩᏂ ᏍᏆᏛᏓᏍᏓᏏ; ᏠᎨᏏ ᎬᎥᏏ, ᎠᎴ ᎾᎿ ᎤᏍᏓᎦᎸᎢ ᎬᎥᏏ; ᏘᏆᏤᎵ ᏴᏫ ᏏᏁᏥ ᎠᏂᎦᏔᎲ ᎾᏍᎩ ᎬᎥᏏ; ᎯᏂᏌᏉ ᏣᏲᎱᎯᏎᎸᎯ.

source: And Abraham boweth himself before the people of the land,
chr: ᎡᏆᎭᎻᏃ ᎤᏗᏌᏓᏕ ᏴᏫ ᎾᎿ ᎠᏁᎯ ᎠᏂᎦᏔᎲᎢ.

source: and speaketh unto Ephron in the ears of the people of the land, saying, 'Only -- if thou wouldest hear me -- I have given the money of the field -- accept from me, and I bury my dead there.'
chr: ᎠᎴ ᎤᏁᏤᎴ ᎢᏆᎶᏂ ᎾᎿ ᎠᏁᎯ ᏴᏫ ᎤᎾᏛᏓᏍᏛᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᎢᏳᏃ ᏍᎩᏁᎮᏍᏗ, ᎬᏔᏲᏏ ᏍᏆᏛᏓᏍᏓᏁᏗᏱ, ᎠᏕᎸ ᏙᏓᎬᏁᎵ ᏠᎨᏏ ᏓᎬᏯᏓᏴᎡᎵ; ᏗᏍᎩᎩᏏ, ᎾᎿᏃ ᏥᏂᏌᏅᎭ ᎠᎩᏲᎱᎯᏎᎸᎯ.

source: And Ephron answereth Abraham, saying to him,
chr: ᎢᏆᎶᏂᏃ ᎤᏁᏤᎴ ᎡᏆᎭᎻ, ᎯᎠ ᏄᏪᏎᎴᎢ,

source: 'My lord, hear me: the land -- four hundred shekels of silver; between me and thee, what [is] it? -- thy dead bury.'
chr: ᏣᎬᏫᏳᎯ ᎠᏆᏤᎵ, ᎠᏴ ᏍᏆᏛᏓᏍᏓᏏ; ᎾᏍᎩ ᎦᏙᎯ ᏅᎩᏧᏈ ᏎᎩᎵ ᎠᏕᎸ ᎤᏁᎬ ᏧᎬᏩᎶᏗ; ᎦᏙᏃ ᎩᏅᏙᏗ ᎠᏴ ᎠᎴ ᏂᎯ ᎾᏍᎩᏉ ᎢᎦᎢ? ᎯᏂᏌᏉᏍᎩᏂ ᏣᏲᎱᎯᏎᎸᎯ.

source: And Abraham hearkeneth unto Ephron, and Abraham weigheth to Ephron the silver which he hath spoken of in the ears of the sons of Heth, four hundred silver shekels, passing with the merchant.
chr: ᎡᏆᎭᎻᏃ ᎤᏛᏓᏍᏓᏁᎴ ᎢᏆᎶᏂ, ᎠᎴ ᎡᏆᎭᎻ ᎠᏕᎸ ᎤᏁᎬ ᎤᏓᏁᎴ ᎢᏆᎶᏂ ᎾᏍᎩ ᎢᎦᎢ ᎤᏁᎢᏍᏔᏅ ᎤᎾᏛᏓᏍᏛ ᎮᏗ ᏧᏪᏥ, ᏅᎩᏧᏈ ᏎᎩᎵ ᎠᏕᎸ ᎤᏁᎬ ᎠᏂᏃᏗᏍᎩ ᎤᏂᏃᏔᏂᏓᏍᏗ.

source: And established are the field of Ephron, which [is] in Machpelah, which [is] before Mamre, the field and the cave which [is] in it, and all the trees which [are] in the field, which [are] in all its border round about,
chr: ᎢᏆᎶᏂᏃ ᎤᎶᎨᏒ ᎹᏈᎳ ᎾᏍᎩ ᎹᎺᎵᏱ ᎢᎬᏱᏗᏢ ᏥᎦᎶᎨᏎᎢ, ᏠᎨᏏ ᎠᎴ ᎾᎿ ᎤᏍᏓᎦᎸᎢ, ᎠᎴ ᏂᎦᏛ ᏕᏡᎬ ᎾᎿ ᏠᎨᏏ, ᎭᏫᏂᏗᏢ ᏓᏟᎶᎢᏙᎸ ᎬᏩᏚᏫᏛ, ᏓᏥᏍᏓᏱᏕᎴ

source: to Abraham by purchase, before the eyes of the sons of Heth, among all entering the gate of his city.
chr: ᎡᏆᎭᎻ ᏧᏤᎵᎦᏯ ᏂᏓᎬᏁᎴᎢ, ᎠᏂᎦᏔᎲ ᎮᏗ ᏧᏪᏥ; ᎾᏍᎩ ᏂᎦᏛ ᎤᏪᏚᎲ ᎦᎶᎯᏍᏗᏱ ᎠᏂᏴᏍᏗᏍᎩ ᎠᏂᎦᏔᎲᎢ.

source: And after this hath Abraham buried Sarah his wife at the cave of the field of Machpelah before Mamre (which [is] Hebron), in the land of Canaan;
chr: ᎣᏂᏃ ᎿᏉ ᎡᏆᎭᎻ ᎤᏂᏌᏁ ᎤᏓᎵᎢ ᏎᎵ ᎹᎩᏈᎳ ᏠᎨᏏ ᎤᏍᏓᎦᎸᎢ, ᎾᏍᎩ ᎹᎺᎵᏱ ᎢᎬᏱᏗᏢ ᏥᎦᎶᎨᏎᎢ; ᎾᏍᎩ ᎯᏆᏂ ᏥᏚᏙᎥ ᎨᎾᏂ ᎦᏓ ᎠᎲᎢ.

source: and established are the field, and the cave which [is] in it, to Abraham for a possession of a burying-place, from the sons of Heth.
chr: ᎾᏍᎩᏃ ᏠᎨᏏ ᎠᎴ ᎾᎿ ᎤᏍᏓᎦᎸᎢ, ᎮᏗ ᏧᏪᏥ ᎬᏩᏍᏓᏱᏕᎴ ᎡᏆᎭᎻ, ᎤᏤᎵᎦᏯ ᏂᎬᏩᏁᎴ ᏗᏓᏂᏐᏗᏱ.

source: Chapter 24
chr: ᎠᏯᏙᎸᎢ 24

source: And Abraham [is] old, he hath entered into days, and Jehovah hath blessed Abraham in all [things];
chr: ᎡᏆᎭᎻᏃ ᎤᏛᏐᏅᎯ ᎨᏎᎢ, ᎠᎴ ᏧᏕᏘᏱᎶᏛ; ᏱᎰᏩᏃ ᏂᎦᎥ ᎪᎱᏍᏗ ᎣᏍᏛ ᎢᏳᏛᏁᎸᎯ ᎨᏎ ᎡᏆᎭᎻ.

source: and Abraham saith unto his servant, the eldest of his house, who is ruling over all that he hath, 'Put, I pray thee, thy hand under my thigh,
chr: ᎡᏆᎭᎻᏃ ᎯᎠ ᏄᏪᏎᎴ ᎤᏓᏂᎵᎨ ᎤᏅᏏᏓᏍᏗ ᎦᏁᎸ ᎡᎯ, ᎾᏍᎩ ᏂᎦᎥ ᎤᎿᎥ ᎤᎬᏫᏳᏌᏕᎩ, Ꭷ, ᏦᏰᏂ ᏥᎦᎶ ᎭᏫᏂᏗᏢ ᎯᏄᏴᏓ;

source: and I cause thee to swear by Jehovah, God of the heavens, and God of the earth, that thou dost not take a wife for my son from the daughters of the Canaanite, in the midst of whom I am dwelling;
chr: ᎾᏍᎩᏃ ᏓᎬᏯᏎᎵᏙᏔᏂ ᏱᎰᏩ ᏚᏙᏍᏛᎢ, ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᎦᎸᎳᏗ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎡᎶᎯ, ᎾᏍᎩ ᎠᏂᎨᎾᏂ ᏧᏁᏥ ᏫᏯᏅᎡᏗ ᏂᎨᏒᎾ ᎠᏇᏥ ᎤᏓᏴᏍᏗ, ᎾᏍᎩᎾ ᎠᏁᎲ ᏣᏆᏓᏑᏯ;

source: but unto my land and unto my kindred dost thou go, and hast taken a wife for my son, for Isaac.'
chr: ᎠᏆᏤᎵᎪᎯᏍᎩᏂ ᏮᏘᎶᏏ, ᎠᎴ ᏗᎩᏴᏫ ᏗᏁᎲᎢ, ᎠᎴ ᎾᎿ ᏮᏘᏯᏅᎯ ᎠᏇᏥ ᎡᏏᎩ ᎤᏓᏴᏍᏗ.

source: And the servant saith unto him, 'It may be the woman is not willing to come after me unto this land; do I at all cause thy son to turn back unto the land from whence thou camest out?'
chr: ᎤᏅᏏᏓᏍᏗᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎢᏳᎾᏃ ᎠᎨᏴ ᏄᏚᎵᏍᎬᎾ ᎢᎨᏎᏍᏗ ᎠᏂ ᎢᏴᏛ ᎠᎩᏍᏓᏩᏙᎯᏍᏗᏱ; ᏥᎪ ᎠᏎ ᎾᎿ ᏗᏣᏓᎴᏅ ᎢᏴᏛ ᏫᏥᏯᏗᏃᎯᏍᏗ ᎢᎨᏎᏍᏗ ᏤᏥ?

source: And Abraham saith unto him, 'Take heed to thyself, lest thou cause my son to turn back thither;
chr: ᎡᏆᎭᎻᏃ ᎯᎠ ᏄᏪᏎᎴᎢ, ᎮᏯᏔᎮᏍᏗ ᏞᏍᏗ ᎠᏇᏥ ᏔᎵᏁ ᎾᎿ ᏥᏫᎯᏯᏘᏅᏍᏔᏂ.

source: Jehovah, God of the heavens, who hath taken me from the house of my father, and from the land of my birth, and who hath spoken to me, and who hath sworn to me, saying, To thy seed I give this land, He doth send His messenger before thee, and thou hast taken a wife for my son from thence;
chr: ᏱᎰᏩ ᎦᎸᎳᏗ ᎤᏁᎳᏅᎯ, ᎾᏍᎩ ᏩᎩᏯᏅᏛ ᏥᎩ ᎡᏙᏓ ᎦᏁᎸ, ᎠᎴ ᏗᎩᏴᏫ ᎤᎾᏤᎵᎪᎯ ᎨᏒᎢ, ᎠᎴ ᎾᏍᎩ ᏣᎩᏁᏤᎸᎩ, ᎠᎴ ᎾᏍᎩ ᏣᏆᏎᎵᏓᏁᎸᎩ ᎯᎠ ᏥᏄᏪᏒᎩ, ᏂᎯ ᏣᏁᏢᏔᏅᎯ ᎯᎠ ᎦᏙᎯ ᏓᎦᏥᏁᎵ; ᎾᏍᎩ ᏓᎦᏅᏏ ᎤᏤᎵ ᏗᎧᎿᏩᏗᏙᎯ ᎢᎬᏱᏗᏢ ᏫᎦᏛᎢ, ᎠᎴ ᎾᎿ ᏮᏘᏯᏅᎯ ᎠᏇᏥ ᎤᏓᏴᏍᏗ.

source: and if the woman be not willing to come after thee, then thou hast been acquitted from this mine oath: only my son thou dost not cause to turn back thither.'
chr: ᎢᏳᏃ ᎠᎨᏴ ᏄᏚᎵᏍᎬᎾ ᎢᎨᏎᏍᏗ ᏅᏓᏣᏍᏓᏩᏛᏍᏗᏱ, ᎿᏉ ᏣᏚᏓᎴᏛ ᎨᏎᏍᏗ ᎯᎠ ᎾᏍᎩ ᏍᏆᏎᎵᏓᏁᎸᎢ; ᏞᏍᏗ ᎠᏗᎾ ᎠᏇᏥ ᏔᎵᏁ ᎾᎿ ᏥᏫᎯᏯᏘᏅᏍᏔᏂ.

source: And the servant putteth his hand under the thigh of Abraham his lord, and sweareth to him concerning this matter.
chr: ᎠᏥᏅᏏᏓᏍᏗᏃ ᎤᏏᏄᏴᏔᏁ ᎤᏅᏏᏙᎯ ᎡᏆᎭᎻ ᎦᎦᎶ ᎭᏫᏂᏗᏢ, ᎠᎴ ᎾᏍᎩ ᎯᎠ ᎤᎬᏩᎵ ᎤᏎᎵᏓᏁᎴᎢ.

source: And the servant taketh ten camels of the camels of his lord and goeth, also of all the goods of his lord in his hand, and he riseth, and goeth unto Aram-Naharaim, unto the city of Nahor;
chr: ᎠᏥᏅᏏᏓᏍᏗᏃ ᎠᏍᎪᎯ ᎨᎻᎵ ᏚᏘᏅᏎᎢ, ᎤᏅᏏᏙᎯ ᏚᏪᎧᎲ ᎨᎻᎵ ᏗᎪᏣᎴᏛ, ᎠᎴ ᎤᏂᎩᏎᎢ; ᏂᎦᏛᏰᏃ ᏧᎬᏩᎶᏗ ᎤᏅᏏᏙᎯ ᎤᏤᎵᎦ ᎾᏍᎩ ᎤᏒᎦᎴᎢ: ᏚᎴᏁᏃ, ᎠᎴ ᎺᏌᏆᏕᎻ ᏭᎶᏎᎢ, ᏁᎰ ᏧᏪᏚᎲᎢ.

source: and he causeth the camels to kneel at the outside of the city, at the well of water, at even-time, at the time of the coming out of the women who draw water.
chr: ᎨᎻᎵᏃ ᏕᎤᎵᏂᏆᏅᏔᏁ ᏙᏱᏗᏢ ᎦᏚᎲᎢ ᎠᎹ ᎠᏢᏗᏱ ᎠᏓᎴᏒᎢ, ᎿᏉ ᎤᏒᎯᏰᏱ ᏥᎨᏐᎢ, ᎾᎯᏳ ᎿᏉ ᎠᏂᎨᏴ·ᎠᎹ ᏥᏓᏂᏟᏍᎪᎢ.

source: And he saith, 'Jehovah, God of my lord Abraham, cause to meet, I pray Thee, before me this day -- (and do kindness with my lord Abraham;
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᏱᎰᏩ ᏣᏁᎳᏅᎯ ᎠᎩᏅᏏᏙᎯ ᎡᏆᎭᎻ ᎤᏤᎵᎦ, ᎣᏍᏛ ᏫᎾᏆᎵᏍᏓᏏ ᎪᎯ ᎢᎦᏥᎩ, ᎠᎴ ᎣᏍᏛ ᏂᏯᏛᏂᏏ ᎠᎩᏅᏏᏙᎯ ᎡᏆᎭᎻ.

source: lo, I am standing by the fountain of water, and daughters of the men of the city are coming out to draw water;
chr: ᎬᏂᏳᏉ ᎠᏴ ᎠᏂ ᏥᏙᎦ ᎠᎹ ᎠᏢᏗᏱ ᎠᏓᎴᏒᎢ; ᎠᎴ ᎦᏚᎲ ᎠᏁᎯ ᎠᏂᏍᎦᏯ ᏧᏁᏥ ᎠᏂᎨᏴ ᎠᎹ ᏓᏂᏢᎯᎯᎭ;

source: and it hath been, the young person unto whom I say, Incline, I pray thee, thy pitcher, and I drink, and she hath said, Drink, and I water also thy camels) -- her Thou hast decided for Thy servant, for Isaac; and by it I know that Thou hast done kindness with my lord.'
chr: ᎯᎠᏃ ᏫᏂᎦᎵᏍᏓ, ᎾᏍᎩ ᎠᏛ ᎯᎠ ᏂᏥᏪᏎᎸᎭ, ᎡᎳᏗ ᏅᎦ ᎠᎹ ᏣᏟᏍᏗ, ᎠᎴ ᎦᏗᏔ; ᎯᎠᏃ ᎾᎩᏪᏎᎸᎭ, ᎭᏗᏔ, ᎠᎴ ᎾᏍᏉ ᎨᎻᎵ ᏙᏓᎬᏯᏗᏔᏍᏓᏁᎵ; ᎾᏍᎩ ᎯᏅᏏᏓᏍᏗ ᎡᏏᎩ ᎯᏯᏑᏯᎡᎸᎯ ᎨᏎᏍᏗ; ᎾᏍᎩᏃ ᎦᏙᎴᎣᎯᏍᏔᏅᎭ ᎣᏍᏛ ᏂᏯᏛᏁᎸ ᎠᎩᏅᏏᏙᎯ.

source: And it cometh to pass, before he hath finished speaking, that lo, Rebekah (who was born to Bethuel, son of Milcah, wife of Nahor, brother of Abraham) is coming out, and her pitcher on her shoulder,
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎠᏏᏉ ᏄᏁᏦᏅᎾ ᎨᏎᎢ, ᎾᏍᎩ ᎬᏂᏳᏉ ᏧᏄᎪᏤᎢ, ᎠᎹ ᎠᏟᏍᏗ ᎤᏃᎭᏝᎮᎢ ᎵᏇᎩ ᎾᏍᎩ ᏇᏚᎡᎵ ᎤᏕᏁᎸᎯ, ᎾᏍᎩ ᎤᏪᏥ ᎻˌᎵᎦ ᏁᎰ ᎡᏆᎭᎻ ᏗᎾᏓᏅᏟ ᎤᏓᎵᎢ.

source: and the young person [is] of very good appearance, a virgin, and a man hath not known her; and she goeth down to the fountain, and filleth her pitcher, and cometh up.
chr: ᎾᏍᎩᏃ ᎠᏛ ᎤᏣᏘ ᎤᏬᏚᎯᏳ ᎨᏎ ᏗᎧᏃᏗᏱ, ᎠᏥᏴᏛ ᏂᎨᏒᎾ, ᎥᏝ ᎠᎴ ᎩᎶ ᎠᏍᎦᏯ ᎤᎦᏙᎥᏒᎯ ᏱᎨᏎᎢ; ᎠᎹᏃ ᎠᏢᏗᏱ ᎠᏓᎴᏒ ᏭᏴᎴᎢ, ᎠᎴ ᎠᎹ ᎠᏟᏍᏗ ᏭᎧᎵᎴᎢ ᏗᎤᏄᎪᏤᏃ.

source: And the servant runneth to meet her, and saith, 'Let me swallow, I pray thee, a little water from thy pitcher;'
chr: ᎠᏥᏅᏏᏓᏍᏗᏃ ᏚᏍᏆᎸᏔᏁ ᏫᏚᏠᏎᎢ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎤᏍᏗ ᎠᎹ ᎬᏯᏗᏔᏏ ᏣᏟᏍᏛᎢ.

source: and she saith, 'Drink, my lord;' and she hasteth, and letteth down her pitcher upon her hand, and giveth him drink.
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎭᏗᏔ ᏣᎬᏫᏳᎯ ᎠᏆᏤᎵᎦ; ᎤᎵᏍᏗᏳᏃ ᎡᎳᏗ ᏄᏩᏁᎴ ᎠᎹ ᎠᏟᏍᏗ ᎠᏰᎲᎢ, ᎤᏬᏰᏂ ᎤᏝᏁᎢ, ᎠᎴ ᎤᎱᏁᎢ.

source: And she finisheth giving him drink, and saith, 'Also for thy camels I draw till they have finished drinking;'
chr: ᎿᏉᏃ ᎤᎱᏃᏅ, ᎯᎠ ᏄᏪᏎᎢ, ᎾᏍᏉ ᎨᎻᎵ ᏗᏣᏤᎵᎦ ᎠᎹ ᏓᎦᏥᏢᎡᎵ ᎬᏂ ᏓᎾᏗᏔᎰᏅᎭ.

source: and she hasteth, and emptieth her pitcher into the drinking-trough, and runneth again unto the well to draw, and draweth for all his camels.
chr: ᎤᎵᏍᏗᏳᏃ ᎠᎹ ᎠᏟᏍᏗ ᎠᏰᎲ ᏥᏳᎯ ᏭᏟᏍᏔᏁᎢ, ᏔᎵᏁᏃ ᎠᎹ ᎠᏢᏗᏱ ᎠᏓᎴᏒ ᏭᏗᏢᏍᏔᏁᎢ ᎠᎹ ᏭᏢᎮᎢ, ᏂᎦᏛᏃ ᎨᎻᎵ ᏚᏢᎡᎴᎢ.

source: And the man, wondering at her, remaineth silent, to know whether Jehovah hath made his way prosperous or not.
chr: ᎠᏍᎦᏯᏃ ᎠᏍᏆᏂᎪᎯᏎᎲ ᎠᎨᏴ ᎡᎳᏪᏉ ᎤᏩᏎᎢ, ᎠᏓᏅᏖᏍᎨ ᏥᎪ ᏱᎰᏩ ᎣᏍᏛ ᎾᏆᏛᏂᏏ ᎨᏙᎲᎢ, ᎡᎵᏍᎨᎢ.

source: And it cometh to pass when the camels have finished drinking, that the man taketh a golden ring (whose weight [is] a bekah), and two bracelets for her hands (whose weight [is] ten [bekahs] of gold),
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ, ᎾᏍᎩ ᎨᎻᎵ ᏚᎾᏘᏔᎰᏅ, ᎾᏍᎩ ᎠᏍᎦᏯ ᎠᏕᎸ ᏓᎶᏂᎨ ᎠᎵᏴᏌᏙᏗ ᏭᎴᏎᎢ, ᎠᏰᎵ ᏎᎩᎵ ᎢᏳᏓᎨᏛ, ᏔᎵᏃ ᏧᏬᏰᏂ ᏧᎵᏰᏠᏍᏗ ᎠᏕᎸ ᏓᎶᏂᎨ ᎠᏍᎪᎯ ᏎᎩᎵ ᎢᏳᏓᎨᏛ.

source: and saith, 'Whose daughter [art] thou? declare to me, I pray thee, is the house of thy father a place for us to lodge in?'
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎦᎪ ᎤᏪᏥ ᏂᎯ? ᏍᎩᏃᎲᏏ; ᏥᎪ ᏰᎵᏉ ᎤᏜᏅᏛ ᏣᏙᏓ ᎦᏁᎸ ᎣᎩᏒᏍᏗᏱ?

source: And she saith unto him, 'I [am] daughter of Bethuel, son of Milcah, whom she hath borne to Nahor.'
chr: ᎯᎠᏃ ᏄᏪᏎᎴᎢ, ᏇᏚᎡᎵ ᎤᏪᏥ ᎠᏴ, ᎾᏍᎩ Ꮋ﹕ᎵᎦ ᎤᏪᏥ ᏁᎰ ᏧᎷᎸᏁᎴᎢ.

source: She saith also unto him, 'Both straw and provender [are] abundant with us, also a place to lodge in.'
chr: ᎯᎠᏃ ᎾᏍᏉ ᏂᎤᏪᏎᎴᎢ, ᎢᏧᎳ ᎧᏁᏍᎦ ᎠᎴ ᎨᎶᎸᏗ ᏰᎵᏉ ᎣᎩᎭ, ᎠᎴ ᎤᏜᏅᏛᏉ ᎠᏒᏍᏗᏱ.

source: And the man boweth, and doth obeisance to Jehovah,
chr: ᎾᏍᎩᏃ ᎠᏍᎦᏯ ᎡᎳᏗ ᏄᏛᏁᎴᎢ, ᎠᎴ ᏱᎰᏩ ᎤᏓᏙᎵᏍᏓᏁᎴᎢ.

source: and saith, 'Blessed [is] Jehovah, God of my lord Abraham, who hath not left off His kindness and His truth with my lord; -- I [being] in the way, Jehovah hath led me to the house of my lord's brethren.'
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎦᎸᏉᏗᏳ ᎨᏎᏍᏗ ᏱᎰᏩ ᎤᏁᎳᏅᎯ ᎡᏆᎭᎻ ᎠᎩᏅᏏᏙᎯ ᎤᏤᎵᎦ; ᎾᏍᎩ ᏄᏲᎯᏍᏔᏅᎾ ᏥᎩ ᎤᏓᏙᎵᏍᏗ ᎨᏒᎢ, ᎠᎴ ᎤᏤᎵᎦ ᏚᏳᎪᏛ ᎨᏒᎢ; ᏅᏃᎯᏰᏃ ᎠᏆᏕᏙᏩᏗᏒᎢ, ᏱᎰᏩ ᎠᏆᏘᏃᎦ ᎠᎩᏅᏏᏙᎯ ᎠᎾᎵᏅᏟ ᎠᏂᏁᎸᎢ.

source: And the young person runneth, and declareth to the house of her mother according to these words.
chr: ᎾᏍᎩᏃ ᎠᏛ ᏚᏍᏆᎸᏔᏁᎢ, ᎠᎴ ᎤᏥ ᎦᏁᎸᎢ ᏫᏚᏃᏁᎴ ᏄᎵᏍᏔᏂᏙᎸᎢ.

source: And Rebekah hath a brother, and his name [is] Laban, and Laban runneth unto the man who [is] without, unto the fountain;
chr: ᎵᏇᎩᏃ ᎤᏙ ᎡᎮᎢ, ᎠᎴ ᎴᏆᏂ ᏚᏙᎡᎢ; ᎴᏆᏂᏃ ᎤᏄᎪᏤ ᏭᏗᏢᏍᏔᏁ ᎠᏍᎦᏯ ᏤᏙᎲ, ᎾᏍᎩ ᎠᎹ ᎠᏢᏗᏱ ᎠᏓᎴᏒᎢ.

source: yea, it cometh to pass, when he seeth the ring, and the bracelets on the hands of his sister, and when he heareth the words of Rebekah his sister, saying, 'Thus hath the man spoken unto me,' that he cometh in unto the man, and lo, he is standing by the camels by the fountain.
chr: ᎯᎠᏃ ᏄᎵᏍᏔᏁᎢ ᎾᏍᎩ ᎠᎢᏴᏌᏙᏗ ᎤᎪᎲ, ᎠᎴ ᏗᎵᏰᏠᏍᏗ ᎤᏙ ᏧᏬᏰᏂ ᏚᎵᏰᏠᎲ ᏚᎪᎲ, ᎠᎴ ᎤᏛᎦᏅ ᎵᏇᎩ ᎤᏙ ᎧᏁᎬᎢ, ᎯᎠ ᏂᎦᏪᏍᎬᎢ, ᎯᎠ ᎾᎩᏪᏎᎸᎩ ᎠᏍᎦᏯ, ᎾᏍᎩ ᏭᎷᏤᎴ ᎠᏍᎦᏯ, ᎠᎴ ᎬᏂᏳᏉ, ᎨᎻᎵ ᎠᏂᏙᎾᎥ ᎦᏙᎨᎢ ᎠᎹ ᎠᏢᏗᏱ ᎠᏓᎴᏒᎢ.

source: And he saith, 'Come in, O blessed one of Jehovah, why standest thou without, and I -- I have prepared the house and place for the camels!'
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎡᎯᏴᎭ, ᏱᎰᏩ ᎣᏍᏛ ᎢᏣᏛᏁᎸᎯ, ᎦᏙᏃ ᏙᏱᏗᏢᏉ ᏗᎯᏙᎦ? ᎠᏆᏛᏅᎢᏍᏔᏅᏰᏃ ᎦᎵᏦᏕ, ᎠᎴ ᎨᎻᎵ ᎤᏂᏴᏍᏗᏱ.

source: And he bringeth in the man into the house, and looseth the camels, and giveth straw and provender for the camels, and water to wash his feet, and the feet of the men who [are] with him:
chr: ᎠᏍᎦᏯᏃ ᎦᎵᏦᏕ ᎤᏴᎴᎢ; ᎨᎻᎵᏃ ᏚᏍᏆᏓᏃᏴᎮᎢ, ᎧᏁᏍᎦᏃ ᎠᎴ ᎨᎶᎸᏗ ᏚᏁᎴ ᎨᎻᎵ, ᎠᎴ ᎠᎹ ᎤᏁᏁᎴ ᏧᎳᏏᏕᏂ ᏧᏬᏑᎴᏗ, ᎠᎴ ᎠᏂᏍᎦᏯ ᏓᏘᏁᎲ ᏧᎾᎳᏏᏕᏂ ᏧᏃᏑᎴᏗ.

source: and setteth before him to eat; but he saith, 'I do not eat till I have spoken my word;' and he saith, 'Speak.'
chr: ᎿᏉᏃ ᎠᏥᏝᏁᎴ ᎤᎵᏍᏓᏴᏗ; ᎠᏎᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎥᏝ ᏴᎦᎦᎵᏍᏓᏴᎲᎦ ᎬᏂ ᏥᏃᏅᎭ ᏄᏍᏛ ᎠᎩᏃᎮᏗ ᎨᏒᎢ. ᎾᏍᎩᏃ ᎯᏁᎩ ᎠᏗᎾ, ᎤᏛᏁᎢ.

source: And he saith, 'I [am] Abraham's servant;
chr: ᎯᎠᏃ ᏄᏪᏎᎢ, ᎠᏴ ᎡᏆᎭᎻ ᎠᎩᏅᏏᏓᏍᏗ.

source: and Jehovah hath blessed my lord exceedingly, and he is great; and He giveth to him flock, and herd, and silver, and gold, and men-servants, and maid-servants, and camels, and asses;
chr: ᏱᎰᏩᏃ ᎤᏣᏘ ᎣᏍᏛ ᏄᏛᏁᎸ ᎠᎩᏅᏏᏙᎯ; ᎠᎴ ᎠᏥᎸᏉᏗᏳ ᏄᎵᏍᏔᏅ; ᎠᎴ ᎠᏫ, ᎠᎴ ᎦᎾᏜᎢ ᏚᏪᎧᏁᎸ, ᎠᎴ ᎠᏕᎸ ᎤᏂᏁᎬ, ᎠᎴ ᎠᏕᎸ ᏓᎶᏂᎨ ᏚᏁᎸ, ᎠᎴ ᎠᏂᏍᎦᏯ ᏧᏅᏏᏓᏍᏗ, ᎠᎴ ᎠᏂᎨᏴ ᏧᏅᏏᏓᏍᏗ, ᎠᎴ ᎨᎻᎵ, ᎠᎴ ᏐᏈᎵ ᏗᏂᎵᎠᏅᎯᏛ ᏚᏪᎧᏁᎸ.

source: and Sarah, my lord's wife, beareth a son to my lord, after she hath been aged, and he giveth to him all that he hath.
chr: ᎠᎴ ᏎᎵ ᎠᎩᏅᏏᏙᎯ ᎤᏓᎵᎢ, ᎠᎩᏅᏏᏙᎯ ᎤᎷᎸᏁᎸᎩ ᎠᏧᏣ ᎿᏉ ᎠᎦᏴᎵᎨ ᎨᏒᎢ; ᎾᏍᎩᏃ ᎤᏁᎸ ᏂᎦᎥ ᎤᎿᎥᎢ.

source: 'And my lord causeth me to swear, saying, Thou dost not take a wife to my son from the daughters of the Canaanite, in whose land I am dwelling.
chr: ᎠᎩᏅᏏᏙᎯᏃ ᎠᏆᏎᎵᏙᏔᏅᎩ, ᎯᎠ ᏄᏪᏒᎩ, ᎥᏞᏍᏗ ᎯᏯᏅᏗ ᏱᎨᏎᏍᏗ ᎠᏇᏥ ᎤᏓᏴᏍᏗ, ᎠᏂᎨᎾᏂ ᏧᏁᏥ ᎾᏍᎩ ᎤᎾᏤᎵᎪᎯ ᎦᏙᎯ ᏥᎨᎠ;

source: If not -- unto the house of my father thou dost go, and unto my family, and thou hast taken a wife for my son.
chr: ᎡᏙᏓᏍᎩᏂ ᏧᏪᏥᏛᎯ ᏗᏁᎲ ᏮᏘᎶᏏ, ᎠᎴ ᏗᎩᏴᏫ ᏗᏁᎲᎢ, ᎠᎴ ᎠᏇᏥ ᎤᏓᏴᏍᏗ ᏮᏘᏯᏅᎯ.

source: 'And I say unto my lord, It may be the woman doth not come after me;
chr: ᎯᎠᏃ ᏅᏥᏪᏎᎸᎩ ᎠᎩᏅᏏᏙᎯ, ᏅᏓᎬᎩᏍᏓᏩᏛᏍᏗᏉ ᏂᎨᏒᎾ ᏱᎩ ᎠᎨᏴ.

source: and he saith unto me, Jehovah, before whom I have walked habitually, doth send His messenger with thee, and hath prospered thy way, and thou hast taken a wife for my son from my family, and from the house of my father;
chr: ᎯᎠᏃ ᎾᎩᏪᏎᎸᎩ, ᏱᎰᏩ, ᎾᏍᎩ ᎠᎦᏔᎲ ᏥᎦᎴᏂᏙᎭ, ᎤᏤᎵ ᏗᎧᎿᏩᏗᏙᎯ ᏓᎦᏅᏏ, ᎠᎴ ᎣᏍᏛ ᎤᏓᏨᏁᎵ ᎭᎢᏒᎢ; ᎠᎴ ᏮᏘᏯᏅᎯ ᎠᏇᏥ ᎤᏓᏴᏍᏗ ᏗᎩᏴᏫ ᏗᏁᎲᎢ, ᎠᎴ ᎡᏙᏓ ᏧᏪᏥᏛᎯ ᏗᏁᎲᎢ.

source: then art thou acquitted from my oath, when thou comest unto my family, and if they give not [one] to thee; then thou hast been acquitted from my oath.
chr: ᎿᏉᏃ ᎥᏝ ᏱᏣᏚᏓᎴᏍᏗ ᏍᏆᏎᎵᏓᏁᎸᎢ; ᏗᎩᏴᏫ ᏗᏁᎲ ᏫᎷᏨᎭ, ᎠᎴ ᏂᎨᏣᎧᏁᎸᎾ ᎢᎨᏎᏍᏗ, ᎿᏉ ᏣᏚᏓᎴᏛ ᎨᏎᏍᏗ ᏍᏆᏎᎵᏓᏁᎸᎢ.

source: 'And I come to-day unto the fountain, and I say, Jehovah, God of my lord Abraham, if Thou art, I pray Thee, making prosperous my way in which I am going --
chr: ᎠᎴ ᎪᎯ ᎢᎦ ᎠᎹ ᎠᏢᏗᏱ ᎠᏓᎴᏒ ᏛᎩᎷᏨᎩ, ᎠᎴ ᎯᎠ ᎾᎩᏪᏒᎩ, ᏱᎰᏩ ᏣᏁᎳᏅᎯ ᎠᎩᏅᏏᏙᎯ ᎡᏆᎭᎻ ᎤᏤᎵᎦ, ᎢᏳᏃ ᎣᏍᏛ ᏂᏨᎿᏗᏎᏍᏗ ᎦᎢᏒᎢ;

source: (lo, I am standing by the fountain of water), then the virgin who is coming out to draw, and I have said unto her, Let me drink, I pray thee, a little water from thy pitcher,
chr: ᎬᏂᏳᏉ ᎠᎹ ᎠᏢᏗᏱ ᎠᏔᎴᏒ ᎤᎶᏗᏢ ᏥᏙᎦ; ᎯᎠᏃ ᏅᏓᎦᎵᏍᏔᏂ, ᎠᏛ ᏗᎦᏄᎪᏨ ᎠᎹ ᎠᏢᎰᎸᎭ, ᎠᎴ ᎯᎠ ᏂᏥᏪᏎᎸᎭ, ᎤᏍᏗ ᎠᎹ ᏣᏟᏍᏛ ᏍᎩᏁᎲᏏ ᎠᏆᏗᏔᏍᏗ;
